Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: ReturnPointee(pointer) was provided to solve this problem specifically.
it_it: ReturnPointee(pointer) è stato fornito per risolvere specificamente questo problema.

source: See the code samples for more examples showing how to use a variety of GoogleTest features.
it_it: Esaminare gli esempi di codice per altri esempi che mostrano come utilizzare le varie funzioni di GoogleTest.

source: SetArgPointee() conveniently makes an internal copy of the value you pass to it, removing the need to keep the value in scope and alive.
it_it: SetArgPointee() crea comodamente una copia interna del valore che gli si passa, eliminando la necessità di mantenere il valore nello scope e in vita [alive].

source: SetArgPointee() says what the side effect is, but doesn't say what the return value should be.
it_it: SetArgPointee() dice qual è l'effetto collaterale, ma non dice quale dovrebbe essere il valore restituito.

source: Some tips:
it_it: Alcuni suggerimenti:

source: StrictMock<T> might not work correctly if the destructor of T is not virtual.
it_it: StrictMock<T> potrebbe non funzionare correttamente se il distruttore di T non è virtuale.

source: StrictMock<T> only works for mock methods defined using the MOCK_METHOD macro directly in the definition of class T.
it_it: StrictMock<T> funziona solo con metodi mock definiti utilizzando la macro MOCK_METHOD direttamente nella definizione della classe T.

source: TEST() and TEST_F() implicitly register their tests with GoogleTest.
it_it: TEST() e TEST_F() registrano implicitamente i loro test con GoogleTest.

source: TEST() arguments go from general to specific.
it_it: Gli argomenti di TEST() vanno dal generale allo specifico.

source: Test is not copyable.
it_it: Test non è copiabile.

source: TestResult is not copyable.
it_it: TestResult non è copiabile.

source: TestSuite is not copyable.
it_it: TestSuite non è copiabile.

source: Tests use assertions to verify the tested code's behavior.
it_it: I test utilizzano le asserzioni per verificare il comportamento del codice in esame.

source: The idea for this assertion was borrowed from Joe Walnes' Hamcrest project, which adds assertThat() to JUnit.
it_it: L'idea per questa asserzione è stata presa in prestito dal progetto Hamcrest di Joe Walnes, che aggiunge assertThat() a JUnit.

source: Tip 1: If you run the test from an Emacs buffer, you can hit <Enter> on the line number to jump right to the failed expectation.
it_it: Tip 1: Se si esegue il test da un buffer Emacs, si può premere <Invio> sul numero di riga per passare direttamente alla expectation non riuscita.

source: Tip 2: If your mock objects are never deleted, the final verification won't happen.
it_it: Tip 2: Se gli oggetti mock non vengono mai eliminati, la verifica finale non avrà luogo.

source: Tips:
it_it: Suggerimenti:

source: Type-parameterized tests are like typed tests, except that they don't require you to know the list of types ahead of time.
it_it: I test type-parameterized sono come quelli tipizzati, tranne per il fatto che non richiedono che si conosca in anticipo l'elenco dei tipi.

source: Typed tests allow you to repeat the same test logic over a list of types.
it_it: I Test tipizzati consentono di ripetere la stessa logica del test su un elenco di tipi.

source: Uninteresting calls and unexpected calls are different concepts in gMock.
it_it: Le chiamate uninteresting e quelle unexpected sono concetti diversi in gMock.

source: UnitTest is a singleton class.
it_it: UnitTest è una classe singleton.

source: UnitTest is not copyable.
it_it: UnitTest non è copiabile.

source: UnorderedElementsAreArray({e0, e1, ..., en}), UnorderedElementsAreArray(a_container), UnorderedElementsAreArray(begin, end), UnorderedElementsAreArray(array), or UnorderedElementsAreArray(array, count)
it_it: UnorderedElementsAreArray({e0, e1, ..., en}), UnorderedElementsAreArray(a_container), UnorderedElementsAreArray(begin, end), UnorderedElementsAreArray(array) o UnorderedElementsAreArray(array, count)

source: Value-parameterized tests allow you to test your code with different parameters without writing multiple copies of the same test.
it_it: I test con valori parametrizzati consentono di testare il codice con parametri diversi senza scrivere più copie dello stesso test.

source: ValuesIn(container) or ValuesIn(begin,end)
it_it: ValuesIn(container) o ValuesIn(begin,end)

source: WithArg<N>(action) (no s after Arg) when the inner action takes one argument.
it_it: WithArg<N>(action) (nessuna s dopo Arg) quando l'action interna prende un argomento.

source: WithoutArgs(action) when the inner action takes no argument, and
it_it: WithoutArgs(action) quando l'action interna accetta nessun argomento, e

source: _ is an instance of what we call matchers.
it_it: _ è un'istanza di quelle che chiamiamo matcher.

source: argument.field (or argument->field when argument is a plain pointer) matches matcher m, where argument is an object of type class.
it_it: argument.field (o argument->field quando argument è un puntatore semplice) corrisponde al matcher m, dove argument è un oggetto di tipo class.

source: argument.first matches e, which can be either a value or a matcher.
it_it: argument.first corrisponde a e, che può essere un valore o un matcher.

source: argument.property() (or argument->property() when argument is a plain pointer) matches matcher m, where argument is an object of type class.
it_it: argument.property() (o argument->property() quando argument è un puntatore semplice) corrisponde al matcher m, dove argument è un oggetto di tipo class.

source: argument (either a smart pointer or a raw pointer) contains a pointer that matches m.
it_it: argument (un puntatore intelligente o un puntatore semplice) contiene un puntatore che corrisponde a m.

source: argument (either a smart pointer or a raw pointer) points to a value that matches matcher m.
it_it: argument (un puntatore intelligente o un puntatore semplice) punta a un valore che corrisponde al matcher m.

source: argument can be any value of the correct type.
it_it: argument può essere qualsiasi valore del tipo corretto.

source: argument can be any value of type type.
it_it: argument può essere qualsiasi valore di tipo type.

source: argument contains string as a sub-string.
it_it: argument contiene la sotto-stringa string.

source: argument contains an element that matches e, which can be either a value or a matcher.
it_it: argument contiene un elemento che corrisponde a e, che può essere un valore o un matcher.

source: argument contains elements that match e, which can be either a value or a matcher, and the number of matches is n, which can be either a value or a matcher.
it_it: argument contiene elementi che corrispondono a e, che può essere un valore o un matcher, e il numero di corrispondenze è n, che può essere un valore o un matcher.

source: argument contains the same number of elements as in container, and for all i, (the i-th element in argument, the i-th element in container) match m, which is a matcher on 2-tuples.
it_it: argument contiene lo stesso numero di elementi di container e per tutti gli i, (l'i-esimo elemento in argument, l'i-esimo elemento container) corrisponde a m, che è un matcher su delle 2-tuple.

source: argument doesn't match matcher m.
it_it: argument non corrisponde al matcher m.

source: argument ends with string suffix.
it_it: argument termina con la stringa suffix.

source: argument evaluates to false in a Boolean context.
it_it: argument valutato false in un contesto booleano.

source: argument evaluates to true in a Boolean context.
it_it: argument valuatato true in un contesto booleano.

source: argument has n + 1 elements, and under some permutation of the elements, each element matches an ei (for a different i), which can be a value or a matcher.
it_it: argument ha n + 1 elementi e, con qualche permutazione degli elementi, ogni elemento corrisponde a ei (per un diverso i), che può essere un valore o un matcher.

source: argument has n + 1 elements, where the i-th element matches ei, which can be a value or a matcher.
it_it: argument ha n + 1 elementi, dove l'i-esimo elemento corrisponde a ei, che può essere un valore o un matcher.

source: argument has type type and is equal to value.
it_it: argument ha tipo type ed è uguale a value.

source: argument is optional<> that contains a value matching m.
it_it: argument è optional<> che contiene un valore che coincide con m.

source: argument is variant<> that holds the alternative of type T with a value matching m.
it_it: argument è un variant<> che contiene l'alternativa di tipo T con un valore corrispondente a m.

source: argument is a NULL pointer (raw or smart).
it_it: argument è un puntatore NULL (raw o smart).

source: argument is a double value approximately equal to a_double, treating two NaNs as equal.
it_it: argument è un valore double approssimativamente uguale a a_double, trattando due NaN uguali.

source: argument is a double value approximately equal to a_double, treating two NaNs as unequal.
it_it: argument è un valore double approssimativamente uguale a a_double, trattando due NaN come diversi.

source: argument is a double value close to a_double (absolute error <= max_abs_error), treating two NaNs as equal.
it_it: argument è un valore double vicino a a_double (errore assoluto <= max_abs_error), considera due NaN come uguali.

source: argument is a double value close to a_double (absolute error <= max_abs_error), treating two NaNs as unequal.
it_it: argument è un valore double vicino a a_double (errore assoluto <= max_abs_error), considera due NaN come diversi.

source: argument is a float value approximately equal to a_float, treating two NaNs as equal.
it_it: argument è un valore float approssimativamente uguale a a_float, trattando due NaN uguali.

source: argument is a float value approximately equal to a_float, treating two NaNs as unequal.
it_it: argument è un valore float approssimativamente uguale a a_float, trattando due NaN come diversi.

source: argument is a float value close to a_float (absolute error <= max_abs_error), treating two NaNs as equal.
it_it: argument è un valore float vicino a a_float (errore assoluto <= max_abs_error), considera due NaN come uguali.

source: argument is a float value close to a_float (absolute error <= max_abs_error), treating two NaNs as unequal.
it_it: argument è un valore float vicio a a_float (errore assoluto <= max_abs_error), considera due NaN come diversi.

source: argument is a base-64 escaped string whose unescaped string matches m.
it_it: argument è una stringa con escape in base 64 la cui stringa senza escape corrisponde a m.

source: argument is a compatible object where each field matches piecewise with the matchers m....
it_it: argument è un oggetto compatibile in cui ogni campo corrisponde a pezzi con i matcher m....

source: argument is a container where every element matches e, which can be either a value or a matcher.
it_it: argument è un contenitore in cui ogni elemento corrisponde a e, che può essere un valore o un matcher.

source: argument is a container whose begin() and end() iterators are separated by a number of increments matching m.
it_it: argument è un contenitore i cui iteratori begin() e end() sono separati da un numero di incrementi pari a m.

source: argument is a container whose size matches m.
it_it: argument è un contenitore la cui dimensione corrisponde a m.

source: argument is a non-null pointer (raw or smart).
it_it: argument è un puntatore non-null (raw o smart).

source: argument is a reference to variable.
it_it: argument è un riferimento a variable.

source: argument is an std::pair whose first field matches m1 and second field matches m2.
it_it: argument è una std::pair il cui primo campo corrisponde a m1 e il secondo campo corrisponde a m2.

source: argument is an empty container (container.empty()).
it_it: argument è un contenitore vuoto (container.empty()).

source: argument is an empty string.
it_it: argument è una stringa vuota.

source: argument is any floating-point type with a NaN value.
it_it: argument è di tipo a virgola mobile con un valore NaN.

source: argument is equal to string, ignoring case.
it_it: argument è uguale a string, ignorando maiuscole e minuscole.

source: argument is equal to string.
it_it: argument è uguale a string.

source: argument is not equal to string, ignoring case.
it_it: argument è diverso da string, ignorando maiuscole e minuscole.

source: argument is not equal to string.
it_it: argument è diverso da string.

source: argument matches UnorderedElementsAre(x0, x1, ..., xk) for some subset {x0, x1, ..., xk} of the expected matchers.
it_it: argument corrisponde a UnorderedElementsAre(x0, x1, ..., xk) per qualche sottoinsieme {x0, x1, ..., xk} dei matcher attesi.

source: argument matches all of the matchers m1 to mn.
it_it: argument corrisponde a tutti i matcher da m1 a mn.

source: argument matches at least one of the matchers m1 to mn.
it_it: argument corrisponde ad almeno uno dei matcher da m1 a mn.

source: argument matches the given regular expression with the match starting at the first character and ending at the last character.
it_it: argument corrisponde all'espressione regolare data con la corrispondenza che inizia con il primo carattere e termina con l'ultimo carattere.

source: argument matches the given regular expression.
it_it: argument corrisponde all'espressione regolare data.

source: argument starts with string prefix.
it_it: argument inizia con la stringa prefix.

source: current_test_info() returns a null pointer if no test is running.
it_it: current_test_info() restituisce un puntatore nullo se non è in esecuzione alcun test.

source: error: gMock will print errors only (least verbose).
it_it: error: gMock stamperà solo gli errori (i meno dettagliati).

source: f(argument) matches matcher m, where f is a function or functor.
it_it: f(argument) corrisponde al matcher m, dove f è una funzione o un funtore.

source: gMock is a library (sometimes we also call it a "framework" to make it sound cool) for creating mock classes and using them.
it_it: gMock è una libreria (a volte la chiamiamo anche "framework" per farlo sembrare interessante) per creare classi mock e utilizzarle.

source: info: gMock will print all informational messages, warnings, and errors (most verbose).
it_it: info: gMock stamperà tutti i messaggi informativi, i warning e gli errori (i più dettagliati).

source: m in Pointwise(m, ...) and UnorderedPointwise(m, ...) should be a matcher for ::std::tuple<T, U> where T and U are the element type of the actual container and the expected container, respectively.
it_it: m in Pointwise(m, ...) e UnorderedPointwise(m, ...) dovrebbe essere un matcher per ::std::tuple<T, U> dove T e U sono rispettivamente il tipo di elemento del contenitore effettivo e del contenitore atteso.

source: predicate(argument) returns something considered by C++ to be true, where predicate is a function or functor.
it_it: predicate(argument) restituisce qualcosa considerato true dal C++, dove predicate è una funzione o un funtore.

source: safely casts matcher m to type Matcher<T>.
it_it: cast in modo sicuro il matcher m nel tipo Matcher<T>.

source: statement doesn't generate any new fatal failures in the current thread.
it_it: statement non genera nuovi errori fatali nel thread corrente.

source: statement in EXPECT_FATAL_FAILURE{_ON_ALL_THREADS}() cannot reference local non-static variables or non-static members of this object.
it_it: statement in EXPECT_FATAL_FAILURE{_ON_ALL_THREADS}() non può fare riferimento a variabili locali non statiche o a membri non statici dell'oggetto this.

source: statement in EXPECT_FATAL_FAILURE{_ON_ALL_THREADS}() cannot return a value.
it_it: statement in EXPECT_FATAL_FAILURE{_ON_ALL_THREADS}() non può restituire un valore.

source: std::function is a general function type introduced in C++11.
it_it: std::function è un tipo di funzione generale introdotto in C++11.

source: t1.SetUp() initializes t1.
it_it: t1.SetUp() inizializzat1.

source: t1.TearDown() cleans up after the test finishes.
it_it: t1.TearDown() esegue la pulizia al termine del test.

source: t1 is destructed.
it_it: t1 viene distrutto.

source: testing::PrintToStringParamName is a builtin test suffix generator that returns the value of testing::PrintToString(GetParam()).
it_it: testing::PrintToStringParamName è un generatore di suffissi nativo che restituisce il valore di testing::PrintToString(GetParam()).

source: warning: gMock will print both warnings and errors (less verbose); it will omit the stack traces in "uninteresting call" warnings.
it_it: warning: gMock stamperà sia i warning che gli errori (meno dettagliato); ometterà gli stack trace nei warning "uninteresting call".

source: A good test verifies the contract of the code. If a test over-specifies, it doesn't leave enough freedom to the implementation.
it_it: Un buon test verifica il contratto del codice. Se un test specifica eccessivamente, non lascia abbastanza libertà all'implementazione.

source: If you omit Times(), gMock will infer the cardinality for you. The rules are easy to remember:
it_it: Se si omette Times(), gMock dedurrà autonomamente la cardinalità. Le regole sono facili da ricordare:

source: The GoogleTest advanced guide explains how to extend the printer to do a better job at printing your particular type than to dump the bytes.
it_it: La Guida Avanzata di GoogleTest spiega come estendere la stampante per eseguire un lavoro migliore stampando il tipo particolare piuttosto che il dump dei byte.

source: a must not return void.
it_it: a non deve restituire void.

source: f must take no arguments.
it_it: f non deve accettare argomenti.

source: iteration is the iteration index, starting from 0.
it_it: iteration è l'indice di iterazione, a partire da 0.

source: std::unique_ptr<T> is probably the most commonly used move-only type.
it_it: std::unique_ptr<T> è probabilmente il tipo di solo spostamento [move-only] più comunemente utilizzato.

source: ASSERT_*() can only be used in void functions, due to exceptions being disabled by our build system.
it_it: ASSERT_*() può essere utilizzato solo nelle funzioni void, poiché le eccezioni sono disabilitate dal nostro sistema di build.

source: EXPECT_* versions generate nonfatal failures, which don't abort the current function.
it_it: Le versioni EXPECT_* generano errori non fatali, che non interrompono la funzione corrente.

source: NaggyMock<T> is a subclass of T, so it can be used wherever an object of type T is accepted.
it_it: NaggyMock<T> è una sottoclasse di T, quindi può essere utilizzata ovunque sia accettato un oggetto di tipo T.

source: NiceMock<T> is a subclass of T, so it can be used wherever an object of type T is accepted.
it_it: NiceMock<T> è una sottoclasse di T, quindi può essere utilizzata ovunque sia accettato un oggetto di tipo T.

source: ON_CALL defines what happens when a mock method is called, but doesn't imply any expectation on the method being called.
it_it: ON_CALL definisce cosa succede quando viene chiamato un metodo mock, ma non implica alcuna aspettativa [expectation] sul metodo che viene chiamato.

source: ON_CALL has a similar syntax to EXPECT_CALL, but it is used for setting default behaviors when you do not require that the mock method is called.
it_it: ON_CALL ha una sintassi simile a EXPECT_CALL, ma viene utilizzato per impostare comportamenti di default quando non è necessario che venga chiamato il metodo mock.

source: SCOPED_TRACE macro will cause the current file name, line number, and the given message to be added in every failure message.
it_it: La macro SCOPED_TRACE farà sì che il nome del file corrente, il numero di riga e il messaggio specificato vengano aggiunti in ogni messaggio di errore.

source: StrictMock<T> is a subclass of T, so it can be used wherever an object of type T is accepted.
it_it: StrictMock<T> è una sottoclasse di T, quindi può essere utilizzata ovunque sia accettato un oggetto di tipo T.

source: Very different.
it_it: Molto diversi.

source: m will match against the raw pointer regardless of the type of argument.
it_it: m corrisponderà al puntatore semplice indipendentemente dal tipo di argument.

source: step defaults to 1.
it_it: Il default di step è 1.

source: Point above could be formatted as "(%v, %v)" for example, and deduce the int values as %d.
it_it: Il Point sopra potrebbe, per esempio, essere formattato come "(%v, %v)" e dedurre i valori int come %d.

source: RUN_ALL_TESTS() always calls TearDown() with each environment object, regardless of whether or not the tests were run.
it_it: RUN_ALL_TESTS() chiama sempre TearDown() con ciascun oggetto dell'ambiente, indipendentemente dal fatto che i test siano stati eseguiti o meno.

source: ScopedTrace accepts explicit file name and line number in arguments, which is useful for writing test helpers.
it_it: ScopedTrace accetta nomi di file e numeri di riga espliciti negli argomenti, il che è utile per scrivere helper di test.

source: _ is a convenient way of saying "any value".
it_it: _ è un modo conveniente per dire "qualsiasi valore".

source: i can range from 0 to total_test_count() - 1.
it_it: i può variare da 0 a total_test_count() - 1.

source: i can range from 0 to test_property_count() - 1.
it_it: i può variare da 0 a test_property_count() - 1.

source: i can range from 0 to total_part_count() - 1.
it_it: i può variare da 0 a total_part_count() - 1.

source: i can range from 0 to total_test_suite_count() - 1.
it_it: i può variare da 0 a total_test_suite_count() - 1.

source: Having a nice mock doesn't change the severity of an unexpected call.
it_it: Avere un mock nice non cambia la gravità di una chiamata unexpected.

source: IgnoreResult() lets you do that.
it_it: IgnoreResult() consente di farlo.

source: TestFixtureName must be the name of a test fixture class—see Test Fixtures.
it_it: TestFixtureName deve essere il nome di una classe fixture di test; vedere Test Fixtures.

source: TestFixtureName must be the name of a value-parameterized test fixture class—see Value-Parameterized Tests.
it_it: TestFixtureName deve essere il nome di una classe fixture con valori parametrizzati; vedere Test con Valori Parametrizzati.

source: EXPECT_CALL not only defines the behavior, but also sets an expectation that the method will be called with the given arguments, for the given number of times (and in the given order when you specify the order too).
it_it: EXPECT_CALL non solo definisce il comportamento, ma imposta anche l'aspettativa [expectation] che il metodo venga chiamato con gli argomenti dati, per il numero dato di volte (e nell'ordine indicato quando si specifica anche l'ordine).

source: GTEST_ALLOW_UNINSTANTIATED_PARAMETERIZED_TEST suppresses this failure for the given test suite.
it_it: GTEST_ALLOW_UNINSTANTIATED_PARAMETERIZED_TEST sopprime questo errore per la test suite specificata.

source: Does not set any expectations that the method will be called.
it_it: Non imposta alcuna expectation che il metodo verrà chiamato.

source: T can be any copyable type.
it_it: T può essere qualsiasi tipo copiabile.

source: name_i is the name of the i-th template parameter, and kind_i specifies whether it's a typename, an integral constant, or a template.
it_it: name_i è il nome dell'i-esimo parametro template, e kind_i specifica se si tratta di un typename, un integrale costante o un template.

source: EXPECT_CALL must precede any code that exercises the mock object.
it_it: EXPECT_CALL deve precedere qualsiasi codice che eserciti l'oggetto mock.
